---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarWorkInstructions.Bent
enum: Autodesk.Revit.DB.Structure.RebarWorkInstructions
source: html/b7a51829-c964-ed2b-6830-d1326d1a6297.htm
---
# Autodesk.Revit.DB.Structure.RebarWorkInstructions.Bent

The bar will be bent in the shop. It will be matched to an existing Rebar Shape. If it can't be matched to an existing one a matching one will be created if it is possible.